set_device -family {PolarFire} -die {MPF300TS} -speed {STD}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\COREJTAGDEBUG\4.0.100\core\corejtagdebug_bufd.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\COREJTAGDEBUG\4.0.100\core\corejtagdebug_uj_jtag.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\COREJTAGDEBUG\4.0.100\core\corejtagdebug_ujtag_wrapper.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\COREJTAGDEBUG\4.0.100\core\corejtagdebug.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\CoreJTAGDebug_0\CoreJTAGDebug_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\CoreRESET_PF_0\CoreRESET_PF_0_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\CoreRESET_PF_0\CoreRESET_PF_0.v}
read_verilog -mode system_verilog -lib CORETIMER_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\CoreTimer_0\CoreTimer_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\CoreTimer_1\CoreTimer_1.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microchip\MiV\MIV_ESS_APB_TO_APB\2.0.100\rtl\MIV_ESS_APB_TO_APB.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreGPIO_0\rtl\vlog\core\coregpio.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_g5.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microchip\MiV\MIV_ESS_RESET_CTRL\2.0.100\rtl\RESET_CTRL.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microchip\MiV\MIV_ESS_RESET_CTRL\2.0.100\rtl\MIV_ESS_RESET_CTRL.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_ESS_0\MIV_ESS_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_mnemonics_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_core_cfg_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_bist_shared_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_bist_seq_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\core_merged\miv_rv32_core_merged.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_opsrv_debug_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_opsrv_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\miv_rv32_opsrv_cfg_pkg.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\opsrv_merged\miv_rv32_opsrv_merged.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\opsrv\miv_rv32_ram_singleport_lp_ecc.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\Microsemi\MiV\MIV_RV32\3.0.100\opsrv\miv_rv32_ram_singleport_lp.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_RV32_CFG1_0\MIV_RV32_CFG1_0_0\miv_rv32.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\MIV_RV32_CFG1_0\MIV_RV32_CFG1_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_CCC_0\PF_CCC_0_0\PF_CCC_0_PF_CCC_0_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_CCC_0\PF_CCC_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_INIT_MONITOR_0\PF_INIT_MONITOR_0_0\PF_INIT_MONITOR_0_PF_INIT_MONITOR_0_0_PF_INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_INIT_MONITOR_0\PF_INIT_MONITOR_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_OSC_0\PF_OSC_0_0\PF_OSC_0_PF_OSC_0_0_PF_OSC.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_OSC_0\PF_OSC_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_SRAM_0\COREAHBLSRAM_PF_0\rtl\vlog\core\CoreAHBLSRAM_AHBLSram_ECC.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_SRAM_0\COREAHBLSRAM_PF_0\rtl\vlog\core\CoreAHBLSRAM_AHBLSram.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_SRAM_0\COREAHBLSRAM_PF_0\rtl\vlog\core\CoreAHBLSRAM_PF.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_SRAM_0\PF_SRAM_0.v}
read_verilog -mode system_verilog {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\BaseDesign\BaseDesign.v}
set_top_level {BaseDesign}
read_sdc -component {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\component\work\PF_CCC_0\PF_CCC_0_0\PF_CCC_0_PF_CCC_0_0_PF_CCC.sdc}
derive_constraints
write_sdc {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\constraint\BaseDesign_derived_constraints.sdc}
write_ndc {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\constraint\BaseDesign_derived_constraints.ndc}
write_pdc {C:\gh-lsd-updates\Future-Avalanche-Board-1\Libero_Projects\MIV_CFG1_BD\constraint\fp\BaseDesign_derived_constraints.pdc}
